import cv2
img = cv2.imread("./img/Ch02_img/blank_500.jpg")

# line(파일 위치, 선 시작 지점(가로, 세로), 선 종료 지점(가로, 세로), 색(파랑, 초록, 빨강), 선 굵기)

cv2.line(img, (50,50), (150,50), (255,0,0))     # 파란색 1픽셀 선
cv2.line(img, (200, 50), (300, 50), (0,255,0))  # 초록색 1픽셀 선
cv2.line(img, (350, 50), (450, 50), (0,0,255))  # 빨간색 1픽셀 선

cv2.line(img, (100,100), (400,100), (255,255,0), 10)    # 하늘색(파랑+초록) 10픽셀 선
cv2.line(img, (100,150), (400,150), (255,0,255), 10)    # 분홍색(파랑+빨강) 10픽셀 선
cv2.line(img, (100,200), (400,200), (0,255,255), 10)    # 노란색(초록+빨강) 10픽셀 선
cv2.line(img, (100,250), (400,250), (200,200,200), 10)  # 회색(파랑+초록+빨강) 10픽셀 선
cv2.line(img, (100,300), (400,300), (0,0,0), 10)        # 검은색 10픽셀 선

cv2.line(img, (100,350), (400,400), (0,0,255), 20, cv2.LINE_4)  # 4연결 선
cv2.line(img, (100,400), (400, 450), (0,0,255), 20, cv2.LINE_8) # 8연결 선
cv2.line(img, (100,450), (400,500), (0,0,255), 20, cv2.LINE_AA) # 안티에얼리어싱 선
cv2.line(img, (0,0), (500,500), (0,0,255))        # 이미지 전체를 가로지르는 대각선 빨간선
cv2.imshow("lines", img)
cv2.waitKey(0)
cv2.destroyAllWindows()